burgrp/py32-svd/svd/py32m031xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <groupName>GPIO</groupName>
      <baseAddress>0x50000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <groupName>GPIO</groupName>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>Inter integrated circuit</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C1</name>
        <description>I2C1 global Interrupt</description>
        <value>23</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>Control register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <description>Peripheral enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ENGC</name>
              <description>General call enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>NOSTRETCH</name>
              <description>Clock stretching disable (Slave mode)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>START</name>
              <description>Start generation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop generation</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>Acknowledge enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>POS</name>
              <description>Acknowledge/PEC Position (for data reception)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FREQ</name>
              <description>Peripheral clock frequency</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>ITERREN</name>
              <description>Error interrupt enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ITEVTEN</name>
              <description>Event interrupt enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ITBUFEN</name>
              <description>Buffer interrupt enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA requests enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LAST</name>
              <description>DMA last transfer</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR1</name>
          <displayName>OAR1</displayName>
          <description>Own address register 1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADD</name>
              <description>Interface address</description>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>Data register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>8-bit data register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <displayName>SR1</displayName>
          <description>Status register 1</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SB</name>
              <description>Start bit (Master mode)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>Address sent (master mode)/matched (slave mode)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTF</name>
              <description>Byte transfer finished</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>Stop detection (slave mode)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RxNE</name>
              <description>Data register not empty (receivers)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TxE</name>
              <description>Data register empty (transmitters)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BERR</name>
              <description>Bus error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ARLO</name>
              <description>Arbitration lost (master mode)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AF</name>
              <description>Acknowledge failure</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun/Underrun</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <displayName>SR2</displayName>
          <description>Status register 2</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>MSL</name>
              <description>Master/slave</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <description>Bus busy</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRA</name>
              <description>Transmitter/receiver</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GENCALL</name>
              <description>General call address (Slave mode)</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>Clock control register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CCR</name>
              <description>Clock control register in Fast/Standard mode (Master mode)</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>FP</name>
              <description>I2C master FP mode selection</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DUTY</name>
              <description>Fast mode duty cycle</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FS</name>
              <description>I2C master mode selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE</name>
          <displayName>TRISE</displayName>
          <description>TRISE register</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>TRISE</name>
              <description>Maximum rise time in Fast/Standard mode (Master mode)</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>THOLDDATA</name>
              <description>desc THOLDDATA</description>
              <bitRange>[11:7]</bitRange>
            </field>
            <field>
              <name>THOLDDATA_SEL</name>
              <description>desc THOLDDATA_SEL</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
