burgrp/py32-svd/svd/py32m031xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>SYSCFG configuration register1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>Memory mapping selection bits</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>TIM1_IC1_SRC</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>TIM2_IC4_SRC</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>ETR_SRC_TIM1</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ETR_SRC_TIM2</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>GPIO_AHB_SEL</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>SYSCFG configuration register2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex-M0+ LOCKUP bit enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVD_LOCK</name>
              <description>PVD lock enable bit</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM1</name>
              <description>COMP1 is enable to input of TIM1 break</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM1</name>
              <description>COMP2 is enable to input of TIM1 break</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM16</name>
              <description>COMP1 is enable to input of TIM16 break</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM16</name>
              <description>COMP2 is enable to input of TIM16 break</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM17</name>
              <description>COMP1 is enable to input of TIM17 break</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM17</name>
              <description>COMP2 is enable to input of TIM17 break</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP1_Ocref_CLR_TIM1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>COMP1_Ocref_CLR_TIM2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>COMP2_Ocref_CLR_TIM1</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>COMP2_Ocref_CLR_TIM2</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <displayName>CFGR3</displayName>
          <description>SYSCFG configuration register3</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP</name>
              <description>DMA channel1 requeset selection</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP</name>
              <description>DMA channel2 requeset selection</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>DMA3_MAP</name>
              <description>DMA channel3 requeset selection</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ENS</name>
          <displayName>PA_ENS</displayName>
          <description>GPIOA noise filter enable register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <description>Noise filter enable, active high</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ENS</name>
          <displayName>PB_ENS</displayName>
          <description>GPIOB noise filter enable register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <description>Noise filter enable, active high</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PF_ENS</name>
          <displayName>PF_ENS</displayName>
          <description>GPIOF noise filter enable register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>PF_ENS</name>
              <description>Noise filter enable, active high</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_CFG</name>
          <displayName>IO_CFG</displayName>
          <description>I2C type IO configure register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>PA_EI2C</name>
              <description>desc PA_EI2C</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>PB_EI2C</name>
              <description>desc PB_EI2C</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>PA_EHS</name>
              <description>desc PA_EHS</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>PB_EHS</name>
              <description>desc PB_EHS</description>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>PF_EI2C</name>
              <description>desc PF_EI2C</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>PF_PU_I2C</name>
              <description>desc PF_PU_I2C</description>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ANA2EN</name>
          <displayName>PA_ANA2EN</displayName>
          <description>GPIOA Analog2 enable register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>PA_ANA2EN</name>
              <description>IO PORTA PAD_ANA2 enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ANA2EN</name>
          <displayName>PB_ANA2EN</displayName>
          <description>GPIOB Analog2 enable register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PB_ANA2EN</name>
              <description>IO PORTB PAD_ANA2 enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PF_ANA2EN</name>
          <displayName>PF_ANA2EN</displayName>
          <description>GPIOF Analog2 enable register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PF_ANA2EN</name>
              <description>IO PORTF PAD_ANA2 enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
